#include <iostream>
#include <cstring>
using namespace std;

int main () {
    int i;
    char str[80];
    char numbers [] [80] = {
        "Мой_номер", "7 916 297-35-39",
        "Настя", "7 926 441-98-70",
        "Мама", "7 926 848-06-84",
        "Папа", "7 926 943-88-79",
        "Сестра", "7 985 043-55-29",
        "Преподаватель", "7 985 619-60-85",
        "Тренер", "7 926 016-75-43",
        "Вася", "373 69175046" 
    };
    cout << "Введите имя абонента: ";
    cin >> str;
    
    for (i = 0; i < 16; i += 2) 
    if (!strcmp(str, numbers[i])) {
        cout << "Телефонный номер: " << numbers[i + 1] << "\n";
        break;
    }
    if (i == 16) cout << "Отсутствует в каталоге.\n";
    
    return 0;
}